<details ><summary>plan for portal 2025-01-02 12:03:54 (UTC)</summary>
        <details ><summary>Locking successful</summary>
  Project LumeWeb/pinner.xyz-devops#portal has been locked by PR #2
</details>

<details open="true"><summary>Plan output</summary>

```terraform
OpenTofu will perform the following actions:

  # cloudns_dns_record.portal[0] will be updated in-place
  ~ resource "cloudns_dns_record" "portal" {
        id    = "564836686"
        name  = "testing"
      ~ value = "104.243.35.41" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # cloudns_dns_record.portal_wildcard[0] will be updated in-place
  ~ resource "cloudns_dns_record" "portal_wildcard" {
        id    = "564836688"
        name  = "*.testing"
      ~ value = "104.243.35.41" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # cloudns_dns_record.renterd_autopilot will be created
  + resource "cloudns_dns_record" "renterd_autopilot" {
      + id    = (known after apply)
      + name  = "autopilot.pinner-portal-renterd-cluster.node"
      + ttl   = 600
      + type  = "CNAME"
      + value = (known after apply)
      + zone  = "pinner.xyz"
    }

  # cloudns_dns_record.renterd_bus will be updated in-place
  ~ resource "cloudns_dns_record" "renterd_bus" {
        id    = "564836590"
      ~ name  = "bus.portal-renterd-cluster.node" -> "bus.pinner-portal-renterd-cluster.node"
      ~ value = "faokgc0v29c2p7drre7tl60jpk.ingress.ny-01.node.infra.lumeweb.com" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # cloudns_dns_record.renterd_workers[0] will be updated in-place
  ~ resource "cloudns_dns_record" "renterd_workers" {
        id    = "564836703"
      ~ name  = "worker-1.portal-renterd-cluster.node" -> "worker-1.pinner-portal-renterd-cluster.node"
      ~ value = "koumo4i5qlcu71v93qc1rfdq9s.ingress.ny-01.node.infra.lumeweb.com" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.mysql.module.mysql_deployment.akash_deployment.service will be updated in-place
  ~ resource "akash_deployment" "service" {
        id                            = "19621155:1:1:akash1nd8v8nc9ufzguwg3yu4fm9q02q72r6y4fhwkg2:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn"
      ~ sdl                           = (sensitive value)
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.portal[0].module.portal_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.redis.module.valkey_deployment.akash_deployment.service will be updated in-place
  ~ resource "akash_deployment" "service" {
        id                            = "19621153:1:1:akash1nd8v8nc9ufzguwg3yu4fm9q02q72r6y4fhwkg2:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn"
      ~ sdl                           = (sensitive value)
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.renterd_cluster.module.renterd_autopilot.module.renterd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.renterd_cluster.module.renterd_workers[0].module.renterd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 5 to add, 6 to change, 0 to destroy.

Changes to Outputs:
  ~ renterd_autopilot_endpoint = "autopilot.portal-renterd-cluster.node.pinner.xyz" -> "autopilot.pinner-portal-renterd-cluster.node.pinner.xyz"
  ~ renterd_bus_endpoint       = "bus.portal-renterd-cluster.node.pinner.xyz" -> "bus.pinner-portal-renterd-cluster.node.pinner.xyz"
  ~ renterd_workers_endpoints  = [
      - "worker-1.portal-renterd-cluster.node.pinner.xyz",
      + "worker-1.pinner-portal-renterd-cluster.node.pinner.xyz",
    ]

─────────────────────────────────────────────────────────────────────────────
```
</details>


<details ><summary>Terraform plan validation check (portal)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |                                               RESOURCE                                                |
|--------|-------------------------------------------------------------------------------------------------------|
| add    | `cloudns_dns_record.renterd_autopilot`                                                                |
|        | `module.portal[0].module.portal_deployment.akash_deployment.service`                                  |
|        | `module.renterd_cluster.module.renterd_autopilot.module.renterd_deployment.akash_deployment.service`  |
|        | `module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service`        |
|        | `module.renterd_cluster.module.renterd_workers[0].module.renterd_deployment.akash_deployment.service` |
| update | `cloudns_dns_record.portal[0]`                                                                        |
|        | `cloudns_dns_record.portal_wildcard[0]`                                                               |
|        | `cloudns_dns_record.renterd_bus`                                                                      |
|        | `cloudns_dns_record.renterd_workers[0]`                                                               |
|        | `module.mysql.module.mysql_deployment.akash_deployment.service`                                       |
|        | `module.redis.module.valkey_deployment.akash_deployment.service`                                      |

| CHANGE |            OUTPUT            |
|--------|------------------------------|
| update | `renterd_autopilot_endpoint` |
|        | `renterd_bus_endpoint`       |
|        | `renterd_workers_endpoints`  |

</details>

</details>